OpenFOAM-13/tutorials/multiphaseEuler/bubblePipe/system/createZonesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createZonesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

injection
{
    type        box;
    zoneType    cell;
    box         (0 -1 0.0) (0.005 1 0.01);
}

outlet
{
    type        box;
    zoneType    cell;
    box         (0 -1 0.89) (0.025 1 0.9);
}

// ************************************************************************* //
